![png](books_erd.png)

# Imports

In [19]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

## Create the Connection

In [20]:
import json
with open('/Users/dmusl/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [21]:
db_name = "books"
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

In [22]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Import Authors

In [23]:
authors = pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [24]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,author_id,int,NO,PRI,None,auto_increment
1,author_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [25]:
authors.dtypes

id              int64
author_name    object
dtype: object

In [26]:
# rename id column
authors.rename(columns={"id":"author_id"}, inplace=True)

In [27]:
# inserting data
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [28]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   author_id        author_name          created_at          updated_at
0          1       Stephen King 2023-10-26 20:22:02 2023-10-26 20:22:02
1          2  F.Scott Fitgerald 2023-10-26 20:22:02 2023-10-26 20:22:02
2          3        Jack London 2023-10-26 20:22:02 2023-10-26 20:22:02
3          4        Jane Austen 2023-10-26 20:22:02 2023-10-26 20:22:02
4          5       Mary Shelley 2023-10-26 20:22:02 2023-10-26 20:22:02

# Import Books

In [29]:
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [30]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,book_id,int,NO,PRI,None,auto_increment
1,title,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,author_id,int,YES,MUL,None,

In [31]:
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [32]:
books.rename(columns={"id":"book_id"}, inplace=True)

In [33]:
# inserting data
books.to_sql("books",conn,index=False, if_exists='append')

6

In [34]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

,book_id,title,created_at,updated_at,author_id
0,1,The Shining,2023-10-26 20:22:03,2023-10-26 20:22:03,1
1,2,It,2023-10-26 20:22:03,2023-10-26 20:22:03,1
2,3,The Great Gatsby,2023-10-26 20:22:03,2023-10-26 20:22:03,2
3,4,The Call of the Wild,2023-10-26 20:22:03,2023-10-26 20:22:03,3
4,5,Pride and Prejudice,2023-10-26 20:22:03,2023-10-26 20:22:03,4
5,6,Frankenstein,2023-10-26 20:22:03,2023-10-26 20:22:03,5

In [35]:
#Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [36]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

# Import Favorites

In [37]:
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [38]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

     Field Type Null  Key Default Extra
0  book_id  int  YES  MUL    None
1  user_id  int  YES  MUL    None

In [39]:
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [40]:
# inserting data
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [41]:
# confirm the data has been added
q = """SELECT * FROM favorites;"""
pd.read_sql(q,conn)

   book_id  user_id
0        1        1
1        2        1
2        3        1
3        4        2
4        5        2
5        5        3
6        6        3

# Import Users

In [42]:
users = pd.read_csv('Data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [43]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,user_id,int,NO,PRI,None,auto_increment
1,first_name,varchar(45),YES,,None,
2,last_name,varchar(45),YES,,None,
3,email,varchar(45),YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [44]:
users.dtypes

id             int64
first_name    object
last_name     object
email         object
dtype: object

In [45]:
users.rename(columns={"id":"user_id"}, inplace=True)

In [46]:
#inserting data
users.to_sql("users",conn,index=False, if_exists='append')

3

In [47]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

,user_id,first_name,last_name,email,created_at,updated_at
0,1,John,Doe,JD@books.com,2023-10-26 20:22:04,2023-10-26 20:22:04
1,2,Robin,Smith,Robin@books.com,2023-10-26 20:22:04,2023-10-26 20:22:04
2,3,Gloria,Rodriguez,grodriquez@books.com,2023-10-26 20:22:04,2023-10-26 20:22:04

# Test the Database

In [48]:
q = """
SELECT books.title, favorites.user_id 
FROM books 
JOIN favorites ON books.book_id = favorites.book_id 
WHERE favorites.user_id = 
    (SELECT users.user_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q,conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1